// Реализация функционального подхода.

var JA;
if (!JA) JA = {};
JA.Func = {};

//==================================================================================================

// Дополнение функционала Array.
Array.prototype.sum = function()
{
    return this.reduce(function(x, y) { return x + y; }, 0);
}

//==================================================================================================

// Слияние двух массивов.
JA.Func.zip_with = function(a, b, f)
{
    var res = [];

    for (var i = 0; i < a.length; i++)
    {
        res.push(f(a[i], b[i]));
    }

    return res;
}

//==================================================================================================
